bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/edc/ATSAMC21E18A.PIC
      <edc:SFRDef edc:_addr="0x42001CA8" edc:access="--------------------------nnnnnn" edc:cname="RXF0A" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="F0AI" edc:desc="Rx FIFO 0 Acknowledge Index" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001CAC" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="RXBC" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="RBSA" edc:desc="Rx Buffer Start Address" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001CB0" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RXF1C" edc:impl="0xFF7FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="F1SA" edc:desc="Rx FIFO 1 Start Address" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="F1S" edc:desc="Rx FIFO 1 Size" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1WM" edc:desc="Rx FIFO 1 Watermark" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="F1OM" edc:desc="FIFO 1 Operation Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001CB4" edc:access="rr----rr--rrrrrr--rrrrrr-rrrrrrr" edc:cname="RXF1S" edc:impl="0xC33F3F7F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="F1FL" edc:desc="Rx FIFO 1 Fill Level" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1GI" edc:desc="Rx FIFO 1 Get Index" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F1PI" edc:desc="Rx FIFO 1 Put Index" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F1F" edc:desc="Rx FIFO 1 Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1L" edc:desc="Rx FIFO 1 Message Lost" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DMS" edc:desc="Debug Message Status" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Idle state" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DBGA" edc:desc="Debug message A received" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DBGB" edc:desc="Debug message A/B received" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DBGC" edc:desc="Debug message A/B/C received, DMA request set" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001CB8" edc:access="--------------------------nnnnnn" edc:cname="RXF1A" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="F1AI" edc:desc="Rx FIFO 1 Acknowledge Index" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001CBC" edc:access="---------------------nnn-nnn-nnn" edc:cname="RXESC" edc:impl="0x777" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="F0DS" edc:desc="Rx FIFO 0 Data Field Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1DS" edc:desc="Rx FIFO 1 Data Field Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RBDS" edc:desc="Rx Buffer Data Field Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001CC0" edc:access="-nnnnnnn--nnnnnnnnnnnnnnnnnnnnnn" edc:cname="TXBC" edc:impl="0x7F3FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TBSA" edc:desc="Tx Buffers Start Address" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="NDTB" edc:desc="Number of Dedicated Transmit Buffers" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TFQS" edc:desc="Transmit FIFO/Queue Size" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="TFQM" edc:desc="Tx FIFO/Queue Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
